InformationRegisters/ОтправленныеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ОтправленныеСообщения</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД_Сообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Адресат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ОтправкаСМС_Сервер/Ext/Module.bsl
//Процедура ОтправкаСМС_ЗаказПокупателяОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
//	
//	Если Отказ Тогда 
//		Возврат;
//	КонецЕсли;
//	
//	Если НЕ ЗначениеЗаполнено(Источник.СтатусЗаказа) Тогда 
//		Возврат;
//	КонецЕсли;
//	
//	Если Не Источник.СтатусЗаказа.АвтоматическиОтправлятьПоУсловию_СМС Тогда 
//		//ИЛИ Не ЗначениеЗаполнено(Источник.СтатусЗаказа.ШаблонСМС) Тогда 
//		Возврат;	
//	КонецЕсли;
//	
//	Попытка
//		НеОтправлятьСообщение = Источник.НеОтправлятьСообщение;
//	Исключение
//		НеОтправлятьСообщение = Ложь;	
//	КонецПопытки;
//	
//	Если НеОтправлятьСообщение Тогда 
//		Возврат;
//	КонецЕсли;
//	
//	ПараметрыШаблона 	= Неопределено;
//	ШаблонСМС 			= Неопределено;
//	
//	СоотвествуетУсловиямАвтоотправки = Справочники.СтатусыЗаказов.ПроверитьУсловияАвтоматическойОтправкиСообщений(Источник.Ссылка, ПараметрыШаблона,Истина);
//	Если НЕ СоотвествуетУсловиямАвтоотправки ИЛИ ТипЗнч(ПараметрыШаблона) <> Тип("Структура") ИЛИ НЕ ПараметрыШаблона.Свойство("ШаблонСМС", ШаблонСМС) Тогда 
//		Возврат;
//	КонецЕсли;

//	//ШаблонСМС = Источник.СтатусЗаказа.ШаблонСМС;
//	ТекстСМС = "";
//	
//	Если ШаблонСМС.ИспользоватьВыражение Тогда
//		
//		Выполнить("ТекстСМС = " + СтрЗаменить(ШаблонСМС.Выражение,"ЭтотОбъект","Источник"));
//	Иначе
//		ТекстСМС = СокрЛП(ШаблонСМС.Текст);
//	КонецЕсли;
//	НомерПолучателя = ОтправкаСМС_Сервер.ПолучитьНомерПолучателяИзЗаказа(Источник.Ссылка);
//	ПредставлениеКонтактногоТелефона = УправлениеСредствамиСвязи.ТолькоЦифрыВНомере(НомерПолучателя).CRM_НомерТелефона;
//	
//	Если БылаАналогичнаяОтправка(Источник,ПредставлениеКонтактногоТелефона,ТекстСМС, ШаблонСМС.Тип) Тогда 
//		Возврат;	
//	КонецЕсли;
//	
//	//Сообщить("Сообщение отправлено!");
//	//Сообщить(ТекстСМС);
//	ОтправитьTurboSMS(СокрЛП(ПредставлениеКонтактногоТелефона),СокрЛП(ТекстСМС), ШаблонСМС, Источник.Ссылка);
//	
//КонецПроцедуры

Процедура ОтправкаEMAIL_ЗаказПокупателяОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//Дандали В. 03.09.2024 + №009169
	Возврат;
	//Дандали В. 03.09.2024 +
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не Источник.СтатусЗаказа.АвтоматическиОтправлятьПоУсловию_EMAIL Тогда 
		//ИЛИ Не ЗначениеЗаполнено(Источник.СтатусЗаказа.ШаблонEMAIL) Тогда 
		Возврат;	
	КонецЕсли;
	
	ПараметрыШаблона 	= Неопределено;
	ШаблонEMAIL 		= Неопределено;
	ШаблонТемыEMAIL 	= Неопределено;
	
	СоотвествуетУсловиямАвтоотправки = Справочники.СтатусыЗаказов.ПроверитьУсловияАвтоматическойОтправкиСообщений(Источник.Ссылка,ПараметрыШаблона,,Истина);
	Если НЕ СоотвествуетУсловиямАвтоотправки ИЛИ ТипЗнч(ПараметрыШаблона) <> Тип("Структура") ИЛИ 
		НЕ (ПараметрыШаблона.Свойство("ШаблонEMAIL", ШаблонEMAIL) И ПараметрыШаблона.Свойство("ШаблонТемыEMAIL", ШаблонТемыEMAIL)) Тогда 
		Возврат;
	КонецЕсли;
	
	Если АдресВЧерномСписке(Источник.Контрагент, СокрЛП(Источник.АдресЭлектроннойПочтыПредставление)) Тогда 
		Возврат;
	КонецЕсли;
	
	//ШаблонEMAIL = Источник.СтатусЗаказа.ШаблонEMAIL;
	ТекстСМС = "";
	
	Если ШаблонEMAIL.ИспользоватьВыражение Тогда
		
		Выполнить("ТекстEMAIL = " + СтрЗаменить(ШаблонEMAIL.Выражение,"ЭтотОбъект","Источник"));
	Иначе
		ТекстEMAIL = СокрЛП(ШаблонEMAIL.Текст);
	КонецЕсли;
	
	Если ШаблонТемыEMAIL.ИспользоватьВыражение Тогда
		
		Выполнить("ТекстТемыEMAIL = " + СтрЗаменить(ШаблонТемыEMAIL.Выражение,"ЭтотОбъект","Источник"));
	Иначе
		ТекстТемыEMAIL = СокрЛП(ШаблонТемыEMAIL.Текст);
	КонецЕсли;
	
	ПредставлениеЭлектроннойПочты = СокрЛП(Источник.АдресЭлектроннойПочтыПредставление);
	
	Если БылаАналогичнаяОтправка(Источник,ПредставлениеЭлектроннойПочты,ТекстEMAIL,ШаблонEMAIL.Тип) Тогда 
		Возврат;	
	КонецЕсли;
	
	//Сообщить("Сообщение ТекстEMAIL отправлено!");
	//Сообщить(ТекстEMAIL);
	
	ПисьмоОтправлено = Ложь;
	УправлениеЭлектроннойПочтой.ОтправитьПисьмо(Константы.ОсновнаяУчетнаяЗаписьЭлПочты.Получить(), ТекстEMAIL, ПредставлениеЭлектроннойПочты, ТекстТемыEMAIL, ПисьмоОтправлено);
	
	Если Источник <> Неопределено И ПисьмоОтправлено = Истина Тогда 
		НаборЗаписей = РегистрыСведений.ОтправленныеСообщения.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Телефон.Значение			= ПредставлениеЭлектроннойПочты;
		НаборЗаписей.Отбор.Телефон.Использование 	= Истина;
		НаборЗаписей.Отбор.Адресат.Значение			= СокрЛП(Источник.Контрагент);
		НаборЗаписей.Отбор.Адресат.Использование 	= Истина;
		НаборЗаписей.Отбор.Заказ.Значение			= Источник.Ссылка;
		НаборЗаписей.Отбор.Заказ.Использование 		= Истина;
		НаборЗаписей.Прочитать();
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период			=  ТекущаяДата();
		Запись.Телефон 			=  ПредставлениеЭлектроннойПочты;
		Запись.Адресат 			=  СокрЛП(Источник.Контрагент);
		Запись.Заказ 			=  Источник.Ссылка;
		
		Запись.Текст 			=  ТекстEMAIL;
		Запись.СтатусОтправки 	=  Перечисления.СтатусыОтправкиСМС.ПустаяСсылка();
		Запись.Шаблон 			=  ?(ШаблонEMAIL = Неопределено, Справочники.ШаблоныСообщений.ПустаяСсылка(), ШаблонEMAIL);
		Запись.ТипШаблона		=	ШаблонEMAIL.Тип;
		Запись.ДатаОтправки 	=  ТекущаяДата();
		Запись.ИД_Сообщения		=  СокрЛП(Новый УникальныйИдентификатор); 
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция СоотвествуетУсловиямАвтоотправки(ЗаказПокупателя)
	
	Результат = Истина;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЗаказПокупателя.СтатусЗаказа);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыЗаказовУсловиеАвтоматическойОтправки.РеквизитДокумента,
	               |	СтатусыЗаказовУсловиеАвтоматическойОтправки.ВидСравнения,
	               |	СтатусыЗаказовУсловиеАвтоматическойОтправки.ЗначениеРеквизитаДокумента
	               |ИЗ
	               |	Справочник.СтатусыЗаказов.УсловияАвтоматическойОтправки КАК СтатусыЗаказовУсловиеАвтоматическойОтправки
	               |ГДЕ
	               |	СтатусыЗаказовУсловиеАвтоматическойОтправки.Ссылка = &Ссылка
	               |	И СтатусыЗаказовУсловиеАвтоматическойОтправки.Использовать = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если ЗаказПокупателя[Выборка.РеквизитДокумента] <> Выборка.ЗначениеРеквизитаДокумента Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция БылаАналогичнаяОтправка(ЗаказПокупателя, Телефон, Текст, ТипШаблона)
	
	СтатусыОтправки = Новый Массив();
	СтатусыОтправки.Добавить(Перечисления.СтатусыОтправкиСМС.ACCEPTD);
	СтатусыОтправки.Добавить(Перечисления.СтатусыОтправкиСМС.ENROUTE);
	СтатусыОтправки.Добавить(Перечисления.СтатусыОтправкиСМС.DELIVRD);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя.Ссылка);
	Запрос.УстановитьПараметр("СтатусыОтправки", СтатусыОтправки);
	Запрос.УстановитьПараметр("Телефон", Телефон);
	Запрос.УстановитьПараметр("Текст", Лев(Текст,500));
	Запрос.УстановитьПараметр("ТипШаблона", ТипШаблона); 
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(*) КАК КоличествоОтправленныхСообщений
	               |ИЗ
	               |	РегистрСведений.ОтправленныеСообщения.СрезПоследних(
	               |			,
	               |			Заказ = &ЗаказПокупателя
	               |				И Телефон = &Телефон
	               |				И Текст ПОДОБНО &Текст
	               |				И ТипШаблона = &ТипШаблона) КАК ОтправленныеСообщенияСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда 
		КоличествоОтправленныхСообщений = 0;
	Иначе
		КоличествоОтправленныхСообщений = Выборка.КоличествоОтправленныхСообщений; 	
	КонецЕсли;
	
	Возврат КоличествоОтправленныхСообщений > 0;
	
КонецФункции

Функция ОтправитьTurboSMS(НомерПолучателя, ТекстСообщения, Шаблон = Неопределено, ЗаказПокупателя = Неопределено) Экспорт

	Driver = "MySQL ODBC 3.51 Driver";
	SERVER = "sql.turbosms.ua";
	DataBase = "users";
	UID = Константы.ЛогинСМС.Получить();
	PWD = Константы.ПарольСМС.Получить(); 
	ConnectionString = "DRIVER=MySQL ODBC 3.51 Driver;SERVER=sql.turbosms.ua;DataBase=users;UID="+UID+";PWD="+PWD+";Mode=Read|Write";
	
	Соединение = Новый COMОбъект("ADODB.Connection");
	Соединение.Mode=3;
	Соединение.ConnectionTimeout = 15;
	Соединение.CursorLocation= 3;
	Соединение.ConnectionString = ConnectionString;
	
	Попытка
		Соединение.Open();
	Исключение
		Сообщить("Не могу подключиться к базе!!!");
		Сообщить(описаниеошибки());
		Возврат 0;
	КонецПопытки;
	
	Соединение.Execute("SET NAMES cp1251");
	
	НЗ=Новый COMОбъект("ADODB.Recordset");
	НЗ.Open("SELECT * FROM " + Константы.ЛогинСМС.Получить(),Соединение,2,3); 
	Нз.AddNew();
	Нз.Fields("number").Value	= НомерПолучателя;
	Нз.Fields("message").Value	= ТекстСообщения;
	Нз.Fields("sign").Value		= Константы.АльфаИмя.Получить();
	Нз.Update();
	Ид=Нз.Fields("id").Value;
	Нз.Close();
	Нз="";
	Соединение.Close();
	Соединение ="";

	Если ЗаказПокупателя <> Неопределено Тогда 
		НаборЗаписей = РегистрыСведений.ОтправленныеСообщения.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Телефон.Значение			= НомерПолучателя;
		НаборЗаписей.Отбор.Телефон.Использование 	= Истина;
		НаборЗаписей.Отбор.Адресат.Значение			= СокрЛП(ЗаказПокупателя.Контрагент);
		НаборЗаписей.Отбор.Адресат.Использование 	= Истина;
		НаборЗаписей.Отбор.Заказ.Значение			= ЗаказПокупателя;
		НаборЗаписей.Отбор.Заказ.Использование 		= Истина;
		НаборЗаписей.Прочитать();
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период			=  ТекущаяДата();
		Запись.Телефон 			=  НомерПолучателя;
		Запись.Адресат 			=  СокрЛП(ЗаказПокупателя.Контрагент);
		Запись.Заказ 			=  ЗаказПокупателя;
		
		Запись.Текст 			=  ТекстСообщения;
		Запись.СтатусОтправки 	=  Перечисления.СтатусыОтправкиСМС.ПустаяСсылка();
		Запись.Шаблон 			=  ?(Шаблон = Неопределено, Справочники.ШаблоныСообщений.ПустаяСсылка(), Шаблон);
		Запись.ТипШаблона		= 	Шаблон.Тип;
		Запись.ДатаОтправки 	=  ТекущаяДата();
		Запись.ИД_Сообщения		=  Ид; 
		НаборЗаписей.Записать();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СостояниеTurboSMS() Экспорт 
    Соединение = Новый COMОбъект("ADODB.Connection");
    СтрокаСоединение = "DRIVER={MySQL ODBC 3.51 Driver};SERVER=94.249.146.189;DataBase=users;UID=" + Константы.ЛогинСМС.Получить() +";PWD=" + Константы.ПарольСМС.Получить();
    Попытка
        Соединение.Open(СтрокаСоединение);
    Исключение
        Сообщить("Не могу подключиться к базе!!!");
        Сообщить(описаниеошибки());
        Возврат Ложь;
    КонецПопытки;
		
	Соединение.Execute("SET NAMES cp1251");//Установим кодировку
	
	//типизируем ячейки
    ТЗ_Запроса = Новый ("ТаблицаЗначений");
	ТЗ_Запроса.Колонки.Добавить("added"		, Новый ОписаниеТипов("Дата"));
	ТЗ_Запроса.Колонки.Добавить("balance"	, Новый ОписаниеТипов("Число"));
	ТЗ_Запроса.Колонки.Добавить("cost"		, Новый ОписаниеТипов("Число"));
	ТЗ_Запроса.Колонки.Добавить("error_code", Новый ОписаниеТипов("Строка"));
	ТЗ_Запроса.Колонки.Добавить("id"		, Новый ОписаниеТипов("Число"));
	ТЗ_Запроса.Колонки.Добавить("is_flash"	, Новый ОписаниеТипов("Число"));
	ТЗ_Запроса.Колонки.Добавить("message"	, Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(500,ДопустимаяДлина.Переменная)));
	ТЗ_Запроса.Колонки.Добавить("msg_id"	, Новый ОписаниеТипов("Строка"));
	ТЗ_Запроса.Колонки.Добавить("number"	, Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(10,ДопустимаяДлина.Переменная)));
	ТЗ_Запроса.Колонки.Добавить("received"	, Новый ОписаниеТипов("Дата"));
	ТЗ_Запроса.Колонки.Добавить("send_time");
	ТЗ_Запроса.Колонки.Добавить("sended"	,Новый ОписаниеТипов("Дата"));
	ТЗ_Запроса.Колонки.Добавить("sign"		,Новый ОписаниеТипов("Строка"));
	ТЗ_Запроса.Колонки.Добавить("status"	,Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100,ДопустимаяДлина.Переменная)));
	ТЗ_Запроса.Колонки.Добавить("wappush"	,Новый ОписаниеТипов("Строка"));	

	RecordSet = Новый COMОбъект("ADODB.RecordSet");
    Command = Новый COMОбъект("ADODB.Command");
    Command.ActiveConnection = Соединение;
    RecordSet = Новый COMОбъект("ADODB.RecordSet");

    Command.CommandText = "select * from " + Константы.ЛогинСМС.Получить(); //
    RecordSet = Command.Execute(); //Выполнение и получение набора данных
	//Для НомерКолонки = 0 По RecordSet.Fields.Count-1 Цикл
	//    ТЗ_Запроса.Колонки.Добавить(RecordSet.Fields.Item(НомерКолонки).Name,,RecordSet.Fields.Item(НомерКолонки).Name, 15);
	//КонецЦикла;
    Если не RecordSet.EOF() Тогда
        RecordSet.MoveFirst();
        Пока RecordSet.EOF() = 0 Цикл
            СтрокаТаблицыЗначений = ТЗ_Запроса.Добавить();
			Для Каждого Колонка Из ТЗ_Запроса.Колонки Цикл
				СтрокаТаблицыЗначений[Колонка.Имя] = RecordSet.Fields(Колонка.Имя).Value; 		
			КонецЦикла;
			
			//Для НомерКолонки = 0 По RecordSet.Fields.Count-1 Цикл
			//    СтрокаТаблицыЗначений[НомерКолонки] = RecordSet.Fields(RecordSet.Fields.Item(НомерКолонки).Name).Value;
			//КонецЦикла;
            RecordSet.MoveNext();
        КонецЦикла;
        RecordSet.Close();
        КонецЕсли;
    Возврат ТЗ_Запроса;
КонецФункции

Функция ОбновитьТаблицуСерверTurboSMS(ТаблицаСМС=Неопределено) Экспорт
	
    ТаблицаСМС = СостояниеTurboSMS();
    Если Не ТипЗнч(ТаблицаСМС) = Тип("ТаблицаЗначений") Тогда
        Возврат ложь;
    КонецЕсли;

	//Для Каждого ТекСтрока Из ТаблицаСМС Цикл
	//    НоваяСтрока = Объект.СМС.Добавить();
	//    НоваяСтрока.Контрагент = СМСРассылка.НайтиКлиентаПоНомеру(ТекСтрока.number);
	//    НоваяСтрока.Номер = ТекСтрока.number;
	//    НоваяСтрока.Текст =  ТекСтрока.message;
	//    НоваяСтрока.Состояние =  ТекСтрока.status ;
	//    НоваяСтрока.Отправлено = ТекСтрока.sended;
	//КонецЦикла;

	//ТаблицаСМС.Сортировать("sended Desc");
	
	Возврат Истина;
	
КонецФункции

Функция АдресВЧерномСписке(Владелец, АдресЭлектроннойПочты) Экспорт
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец"				, Владелец);
	Запрос.УстановитьПараметр("АдресЭлектроннойПочты"	, АдресЭлектроннойПочты);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЧерныйСписокEMAIL.ЗапретИспользования
	               |ИЗ
	               |	РегистрСведений.ЧерныйСписокEMAIL КАК ЧерныйСписокEMAIL
	               |ГДЕ
	               |	ЧерныйСписокEMAIL.Владелец = &Владелец
	               |	И ЧерныйСписокEMAIL.АдресЭлектроннойПочты ПОДОБНО &АдресЭлектроннойПочты";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Результат = Выборка.ЗапретИспользования;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНомерПолучателяИзЗаказа(ЗаказСсылка, Интерактивно = Ложь) Экспорт
	
	НомерПолучателя = "";
	Если ПолучитьФункциональнуюОпцию("ОтдельныйНомерДляСМС") Тогда
		НомерПолучателя = СокрЛП(ЗаказСсылка.ТелефонДляСМС);
		Если ПустаяСтрока(НомерПолучателя) Тогда
			#Если Клиент Тогда
				Если ПолучитьФункциональнуюОпцию("ОтдельныйНомерДляСМС") И Интерактивно Тогда 
					Ответ = Вопрос("Не указан номер, для отправки СМС. Использовать основной номер из заказа?",РежимДиалогаВопрос.ДаНет);
					Если Ответ = КодВозвратаДиалога.Нет Тогда 
						Возврат НомерПолучателя;
					КонецЕсли;
				КонецЕсли;
			#КонецЕсли
			НомерПолучателя = СокрЛП(ЗаказСсылка.КонтактныйТелефонПредставление);
		КонецЕсли;
	Иначе
		НомерПолучателя = СокрЛП(ЗаказСсылка.КонтактныйТелефонПредставление);
	КонецЕсли;
	
	Возврат НомерПолучателя;
	
КонецФункции
